code/org-project-manager.org
# Project-Manager mode
* Header 							   :noexport:
:PROPERTIES:
#+TITLE: An emacs-org project manager for applied statisticians
#+EMAIL: tag@biostat.ku.dk
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc author:nil
#+LaTeX_HEADER:\usepackage{authblk}
#+LaTeX_HEADER:\usepackage{natbib}
#+LaTeX_HEADER:\usepackage[T1]{fontenc}
#+LaTeX_HEADER:\renewcommand*\familydefault{\sfdefault}
#+LaTeX_HEADER:\usepackage[table,usenames,dvipsnames]{xcolor}
#+LaTeX_HEADER:\definecolor{lightGray}{gray}{0.98}
#+LaTeX_HEADER:\definecolor{medioGray}{gray}{0.83}
#+LaTeX_HEADER:\rowcolors{1}{medioGray}{lightGray}
#+LaTeX_HEADER:\usepackage{attachfile}
#+LaTeX_HEADER:\usepackage{array}
#+LaTeX_HEADER:\author{Thomas Alexander Gerds}
#+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen, Denmark}
#+LaTeX_HEADER:\author{Klaus K\"ahler Holst}
#+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen, Denmark}
#+LaTeX_HEADER:\author{Jochen Knaus}
#+LaTeX_HEADER:\affil{Department of Medical Biometrie and Medical Informatics, University of Freiburg, Freiburg, Germany}
#+LaTeX_HEADER:\newcommand{\sfootnote}[1]{\renewcommand{\thefootnote}{\fnsymbol{footnote}}\footnote{#1}\setcounter{footnote}{0}\renewcommand{\thefootnote}{\arabic{foot note}}}
#+LaTeX_HEADER:\makeatletter\def\blfootnote{\xdef\@thefnmark{}\@footnotetext}\makeatother
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_HEADER \itemsep2pt
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+LaTeX_HEADER: \usepackage{color}
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER: keywordstyle=\color{blue},
#+LATEX_HEADER: commentstyle=\color{red},
#+LATEX_HEADER: stringstyle=\color[rgb]{0,.5,0},
#+LATEX_HEADER: basicstyle=\ttfamily\small,
#+LATEX_HEADER: columns=fullflexible,
#+LATEX_HEADER: breaklines=true,        % sets automatic line breaking
#+LATEX_HEADER: breakatwhitespace=false,    % sets if automatic breaks should only happen at whitespace
#+LATEX_HEADER: numbers=left,
#+LATEX_HEADER: numberstyle=\ttfamily\tiny\color{gray},
#+LATEX_HEADER: stepnumber=1,
#+LATEX_HEADER: numbersep=10pt,
#+LATEX_HEADER: backgroundcolor=\color{white},
#+LATEX_HEADER: tabsize=4,
#+LATEX_HEADER: showspaces=false,
#+LATEX_HEADER: showstringspaces=false,
#+LATEX_HEADER: xleftmargin=.23in,
#+LATEX_HEADER: frame=single,
#+LATEX_HEADER: basewidth={0.5em,0.4em}
#+LATEX_HEADER: }
#+PROPERTY: session *R* 
#+PROPERTY: cache yes
#+PROPERTY: tangle yes
#+PROPERTY: colnames yes
:END:

* Introduction 

This document simulaneously describes and defines a project manager
for applied statistical workflows based on the fabulous and popular
emacs =org-mode=. Really it describes and automates one out of many
possibilities to customize =org-mode=.

** Set up 

The first thing to do is

** Git support
*** Requirements

You need to install the program git

*** Git hub

To do push changes to a github repository it is usefull to set up git  
https://help.github.com/articles/set-up-git
and to be free of typing the username and password when doing "git push".

If you use the SSH repo URL instead, SSH keys are used for
authentication. This guide offers help generating and using an SSH key
pair:  https://help.github.com/articles/generating-ssh-keys

* Project manager code :noexport:
** Dependencies

#+BEGIN_SRC emacs-lisp :export code
(require 'ido)
(require 'org)  
(require 'deft)
#+END_SRC

** Setup and maintenance
*** The project manager file   
#+BEGIN_SRC emacs-lisp :export code
  (defvar org-project-manager-default-directory (file-name-as-directory org-directory) "A place for new projects.")
  (defvar org-project-manager (concat
                               (file-name-as-directory org-directory)
                                         "Projects.org")
              "Where the org-project-manager defines the projects. The contents of
          the file has the following structure:
          
      ,* Fun projects
       :PROPERTIES:
       :LOCATION: ~/fun
       :END:  
          
      ,**** Tex Avery Collection 
      :PROPERTIES:
      :index: bla.org
      :nickname: texAvery
      :others: Foghorn Leghorn
      :END:
    
      ,**** Cultural stuff like films, tv-series, music etc.
      :PROPERTIES:
      :nickname: culture
      :END:
    
      ,* Work projects
       :PROPERTIES:
       :LOCATION: ~/work
       :END:    
    
    ,**** ACTIVE BinomialRegression
    :PROPERTIES:
    :NICKNAME: BinomialRegression
    :END:
      ")
#+END_SRC

#+BEGIN_SRC emacs-lisp :export code
(defvar org-project-manager-project-level 4
"Subheading level at which projects are defined
in `org-project-manager'.")
#+END_SRC

The project manager is in org-mode (major-mode). To change specific
keystrokes only in this file, the current solution is to put
a minor-mode on top of it.
    
#+BEGIN_SRC emacs-lisp :export code
  (defvar org-project-manager-minor-mode nil)
  (make-variable-buffer-local 'org-project-manager-minor-mode)
  (defvar org-project-manager-minor-mode-map (make-sparse-keymap)
    "Keymap used for `org-project-manager-minor-mode' commands.")
  (or (assq 'org-project-manager-minor-mode minor-mode-map-alist)
      (setq minor-mode-map-alist
            (append minor-mode-map-alist
                    (list (cons 'org-project-manager-minor-mode org-project-manager-minor-mode-map)))))
  (or (assq 'org-project-manager-minor-mode minor-mode-alist)
      (setq minor-mode-alist
            (cons '(org-project-manager-minor-mode " Project") minor-mode-alist)))
  (defun org-project-manager-minor-mode (&optional arg)
    "A minor mode for using org Project Manager."
    (interactive "P")
    ;; (make-variable-buffer-local 'hippie-expand-try-functions-list)
    (setq org-project-manager-minor-mode
          (not (or (and (null arg) org-project-manager-minor-mode)
                   (<= (prefix-numeric-value arg) 0))))
    (add-hook 'after-save-hook 'org-project-manager-refresh nil 'local))
  (define-key org-project-manager-minor-mode-map [(meta return)] 'org-project-manager-return)
  (define-key org-project-manager-minor-mode-map [(meta n)] 'org-project-manager-next-project)
  (define-key org-project-manager-minor-mode-map [(meta p)] 'org-project-manager-previous-project)
  (add-hook 'find-file-hooks 
            (lambda ()
              (let ((file (buffer-file-name)))
                (when (and file (equal file (expand-file-name org-project-manager)))
                  (org-project-manager-minor-mode)))))
#+END_SRC
   
*** Dynamically updating lists 
    
#+BEGIN_SRC emacs-lisp :export code
       (defvar org-project-manager-project-alist nil
             "Alist of projects associating the nickname of the project
       with information like the location of the project, the index file, collaborators, category, publishing-directory, etc.")
      
      (defvar org-project-manager-current-project nil "The currently selected project.")
             
                 
    (defun org-project-manager-parse-projects (&optional all)
         "Parse file 'project-manager' and update 'org-project-manager-project-alist'"
         (interactive)
         (save-excursion
           (setq org-project-manager-project-alist nil)
           (set-buffer (find-file-noselect org-project-manager))
           (save-buffer)
           (goto-char (point-min))
           (while (org-project-manager-forward-project)
               (let* ((loc (or (org-entry-get nil "LOCATION" 'inherit) org-project-manager-default-directory))
                      (category (org-entry-get nil "CATEGORY" 'inherit))
                      (others (org-entry-get nil "OTHERS" nil))
                      (publish-dir (org-entry-get nil "PUBLISH" 'inherit))
                      (name (or (org-entry-get nil "NICKNAME" nil)
                                (nth 4 (org-heading-components))))
                      (git (org-entry-get nil "GIT" 'inherit))
                      (index (or (org-entry-get nil "INDEX" nil)
                                 (let ((default-org-home
                                         (concat (file-name-as-directory loc)
                                                 name
                                                 org-project-manager-org-location)))
                                   ;; (make-directory default-org-home t)
                                   (concat (file-name-as-directory default-org-home) name ".org")))))
                 (unless (file-name-absolute-p index)
                   (setq index
                         (expand-file-name (concat (file-name-as-directory loc) name "/" index))))
                 (add-to-list 'org-project-manager-project-alist
                              (list name
                                    (list (cons "location"  loc)
                                          (cons "index" index)
                                          (cons "category" category)
                                          (cons "others" others)
                                          (cons "git" git)
                                          (cons "publish-directory" publish-dir))))))
             org-project-manager-project-alist))
       
    (defvar org-project-manager-project-categories nil
  "List of categories for sorting projects.")
  
  (defun org-project-manager-get-buffer-props (property)
      "Get a table of all values of PROPERTY used in the buffer, for completion."
      (let (props)
        (save-excursion
          (goto-char (point-min))
          (while (re-search-forward (concat ":" property ":") nil t)
            (add-to-list 'props (list
                                 (org-entry-get
                                  nil property nil)))))
        props))
    
  (defun org-project-manager-parse-categories ()
      (interactive)
        (set-buffer (find-file-noselect org-project-manager))
        (setq org-project-manager-project-categories
              (reverse (org-project-manager-get-buffer-props "CATEGORY"))))
  
  (defun org-project-manager-refresh ()
    (interactive)
    (org-project-manager-parse-categories)
    (org-project-manager-parse-projects))
  
#+END_SRC

*** Lists of project-index and project-org files 

#+BEGIN_SRC emacs-lisp :export code
(defun org-project-manager-index-list (&optional category extension not-exist-ok update)
 "Return a list of project specific indexes.
Projects are filtered by CATEGORY unless CATEGORY is nil.
Only existing files are returned unless NOT-EXIST-OK is non-nil.
Only files ending on EXTENSION are returned unless EXTENSION is nil.
If UPDATE is non-nil first parse the file org-project-manager."
 (interactive "P")
 (if update
 (org-project-manager-refresh))
 (delq nil (mapcar '(lambda (x)
 (let ((f (org-project-manager-get-index x)))
       (when (and (or not-exist-ok (file-exists-p f))
                (or (not extension)
                    (string= extension (file-name-extension f))))
                     f)))
  (if category
      (delq nil (mapcar '(lambda (p) (if (string= category (org-project-manager-get-category p))
                           p))
                        org-project-manager-project-alist))
  org-project-manager-project-alist))))
#+END_SRC

*** The profile of a single project

#+BEGIN_SRC emacs-lisp :export code   
 (defvar org-project-manager-org-location "/"
    "Relative to the project location this defines
  the path to the index file of a project. If set to
  '/org/' then the index file will be placed
  in a subdirectory 'org' of the project directory.")
#+END_SRC

#+BEGIN_SRC emacs-lisp :export code
(defvar org-project-manager-default-category "Unsorted" "Category for new projects.")
;; (setq org-refile-targets (quote ((org-project-manager :maxlevel . 3) (nil :maxlevel . 2))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :export code
(defun org-project-manager-set-nickname ()
  (interactive)
  (org-set-property
   "NICKNAME"
   (read-string "NickName for project: "
		(nth 4 (org-heading-components)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :export code
(defun org-project-manager-set-others ()
  (interactive)
  (let* ((pro (assoc (org-project-manager-project-at-point t)
    org-project-manager-project-alist))
         (others (cdr (assoc "others" (cadr pro))))
         (init (if others (concat others ", ") "")))
       ;; (org-entry-get nil "others")
(if pro
     (org-set-property
     "others"
   (replace-in-string
    (read-string (concat "Set collaborators for " (car pro) ": ") init)
    "[,\t ]+$" "")))))


(defun org-project-manager-fix-others ()
(interactive)
(goto-char (point-min))
(while (org-project-manager-forward-project)
  (org-project-manager-set-others)))
#+END_SRC

** Adding new projects
