code/org-project-manager.tex
% Created 2012-09-07 Fri 10:46
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{color}
\usepackage{listings}
\usepackage{authblk}
\usepackage{natbib}
\usepackage[T1]{fontenc}
\renewcommand*\familydefault{\sfdefault}
\usepackage[table,usenames,dvipsnames]{xcolor}
\definecolor{lightGray}{gray}{0.98}
\definecolor{medioGray}{gray}{0.83}
\rowcolors{1}{medioGray}{lightGray}
\usepackage{attachfile}
\usepackage{array}
\author{Thomas Alexander Gerds}
\affil{Department of Biostatistics, University of Copenhagen, Denmark}
\author{Klaus K\"ahler Holst}
\affil{Department of Biostatistics, University of Copenhagen, Denmark}
\author{Jochen Knaus}
\affil{Department of Medical Biometrie and Medical Informatics, University of Freiburg, Freiburg, Germany}
\newcommand{\sfootnote}[1]{\renewcommand{\thefootnote}{\fnsymbol{footnote}}\footnote{#1}\setcounter{footnote}{0}\renewcommand{\thefootnote}{\arabic{foot note}}}
\makeatletter\def\blfootnote{\xdef\@thefnmark{}\@footnotetext}\makeatother
\usepackage{color}
\lstset{
keywordstyle=\color{blue},
commentstyle=\color{red},
stringstyle=\color[rgb]{0,.5,0},
basicstyle=\ttfamily\small,
columns=fullflexible,
breaklines=true,        % sets automatic line breaking
breakatwhitespace=false,    % sets if automatic breaks should only happen at whitespace
numbers=left,
numberstyle=\ttfamily\tiny\color{gray},
stepnumber=1,
numbersep=10pt,
backgroundcolor=\color{white},
tabsize=4,
showspaces=false,
showstringspaces=false,
xleftmargin=.23in,
frame=single,
basewidth={0.5em,0.4em}
}
\providecommand{\alert}[1]{\textbf{#1}}

\title{An emacs-org project manager for applied statisticians}
%\author{Thomas Alexander Gerds}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.1}}

\begin{document}

\maketitle

\section{Introduction}
\label{sec-1}


This document simulaneously describes and defines a project manager
for applied statistical workflows based on the fabulous and popular
emacs orgmode. Really it describes and automates one out of many
possibilities to customize orgmode.
\subsection{Set up}
\label{sec-1-1}


The first thing to do is
\subsection{Git support}
\label{sec-1-2}
\subsubsection{Requirements}
\label{sec-1-2-1}


You need to install the program git
\subsubsection{Git hub}
\label{sec-1-2-2}


To do push changes to a github repository it is usefull to set up git  
\href{https://help.github.com/articles/set-up-git}{https://help.github.com/articles/set-up-git}
and to be free of typing the username and password when doing ``git push''.

If you use the SSH repo URL instead, SSH keys are used for
authentication. This guide offers help generating and using an SSH key
pair:  \href{https://help.github.com/articles/generating-ssh-keys}{https://help.github.com/articles/generating-ssh-keys}

\end{document}
